{
  "nodes": [
    {
      "op": "null", 
      "name": "csr_data", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "linear_weight", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__shape__": "(26000, 256)", 
        "__storage_type__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot0", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "linear_bias", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dns_data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_0_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_1_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_2_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_3_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_4_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_5_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_6_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_7_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_8_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_9_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_10_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_11_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_12_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_13_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_14_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_15_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_16_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_17_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_18_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_19_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_20_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_21_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_22_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_23_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_24_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_25_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "SliceSplitEmbeddingConcatFuse", 
      "name": "SliceSplitEmbeddingConcatFuse_0", 
      "attrs": {
        "concat_dim": "1", 
        "cont_begin": "(0,26)", 
        "cont_end": "(None,39)", 
        "embed_begin": "(0,0)", 
        "embed_end": "(None,26)", 
        "input_dims": "[1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000]", 
        "num_outputs": "26", 
        "output_dims": "[32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32]", 
        "squeeze_axis": "1"
      }, 
      "inputs": [
        [5, 0, 0], 
        [6, 0, 0], 
        [7, 0, 0], 
        [8, 0, 0], 
        [9, 0, 0], 
        [10, 0, 0], 
        [11, 0, 0], 
        [12, 0, 0], 
        [13, 0, 0], 
        [14, 0, 0], 
        [15, 0, 0], 
        [16, 0, 0], 
        [17, 0, 0], 
        [18, 0, 0], 
        [19, 0, 0], 
        [20, 0, 0], 
        [21, 0, 0], 
        [22, 0, 0], 
        [23, 0, 0], 
        [24, 0, 0], 
        [25, 0, 0], 
        [26, 0, 0], 
        [27, 0, 0], 
        [28, 0, 0], 
        [29, 0, 0], 
        [30, 0, 0], 
        [31, 0, 0]
      ]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight", 
      "attrs": {"num_hidden": "1024"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias", 
      "attrs": {"num_hidden": "1024"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attrs": {"num_hidden": "1024"}, 
      "inputs": [[32, 0, 0], [33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight", 
      "attrs": {"num_hidden": "512"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias", 
      "attrs": {"num_hidden": "512"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attrs": {"num_hidden": "512"}, 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attrs": {"num_hidden": "256"}, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[4, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "model", 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    33, 
    34, 
    37, 
    38, 
    41, 
    42, 
    45
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47
  ], 
  "heads": [[46, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}
