{
  "nodes": [
    {
      "op": "null", 
      "name": "csr_data", 
      "attrs": {"__storage_type__": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "linear_weight", 
      "attrs": {
        "__init__": "[\"normal\", {\"sigma\": 0.01}]", 
        "__shape__": "(26000, 256)", 
        "__storage_type__": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "dot", 
      "name": "dot0", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "linear_bias", 
      "attrs": {"__shape__": "(256,)"}, 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add0", 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dns_data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_0_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_1_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_2_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_3_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_4_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_5_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_6_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_7_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_8_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_9_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_10_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_11_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_12_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_13_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_14_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_15_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_16_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_17_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_18_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_19_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_20_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_21_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_22_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_23_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_24_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_25_weight", 
      "attrs": {"__storage_type__": "1"}, 
      "inputs": []
    }, 
    {
      "op": "SliceSplitEmbeddingConcatFuse", 
      "name": "SliceSplitEmbeddingConcatFuse_0", 
      "attrs": {
        "concat_dim": "1", 
        "cont_begin": "(0,26)", 
        "cont_end": "(None,39)", 
        "embed_begin": "(0,0)", 
        "embed_end": "(None,26)", 
        "input_dims": "[1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000,1000]", 
        "num_outputs": "26", 
        "output_dims": "[32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32,32]", 
        "squeeze_axis": "1"
      }, 
      "inputs": [
        [5, 0, 0], 
        [6, 0, 0], 
        [7, 0, 0], 
        [8, 0, 0], 
        [9, 0, 0], 
        [10, 0, 0], 
        [11, 0, 0], 
        [12, 0, 0], 
        [13, 0, 0], 
        [14, 0, 0], 
        [15, 0, 0], 
        [16, 0, 0], 
        [17, 0, 0], 
        [18, 0, 0], 
        [19, 0, 0], 
        [20, 0, 0], 
        [21, 0, 0], 
        [22, 0, 0], 
        [23, 0, 0], 
        [24, 0, 0], 
        [25, 0, 0], 
        [26, 0, 0], 
        [27, 0, 0], 
        [28, 0, 0], 
        [29, 0, 0], 
        [30, 0, 0], 
        [31, 0, 0]
      ]
    }, 
    {
      "op": "_contrib_quantize_v2", 
      "name": "concat0_output_quantize", 
      "attrs": {
        "max_calib_range": "11.039369", 
        "min_calib_range": "-0.355414", 
        "out_type": "uint8"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected0_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "quantized_sg_mkldnn_fully_connected_relu_0", 
      "attrs": {
        "max_calib_range": "5.822273", 
        "min_calib_range": "-0.000000", 
        "quantized": "True", 
        "with_relu": "True"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [33, 1, 0], [33, 2, 0], [36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "concat0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fullyconnected0_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fullyconnected0_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fullyconnected0", 
              "attrs": {"num_hidden": "1024"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation0", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected1_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "quantized_sg_mkldnn_fully_connected_relu_1", 
      "attrs": {
        "max_calib_range": "31.440962", 
        "min_calib_range": "-0.000000", 
        "quantized": "True", 
        "with_relu": "True"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [40, 1, 0], [40, 2, 0], [43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_fully_connected_relu_0_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fullyconnected1_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fullyconnected1_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fullyconnected1", 
              "attrs": {"num_hidden": "512"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }, 
            {
              "op": "Activation", 
              "name": "activation1", 
              "attrs": {"act_type": "relu"}, 
              "inputs": [[3, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4, 5], 
          "heads": [[4, 0, 0]]
        }
      ]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias_quantize", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_weight_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias_quantize_min", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected2_bias_quantize_max", 
      "inputs": []
    }, 
    {
      "op": "_sg_mkldnn_fully_connected", 
      "name": "quantized_sg_mkldnn_fully_connected_2", 
      "attrs": {
        "enable_float_output": "True", 
        "quantized": "True"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0], [47, 1, 0], [47, 2, 0], [50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 0]], 
      "subgraphs": [
        {
          "nodes": [
            {
              "op": "null", 
              "name": "sg_mkldnn_fully_connected_relu_1_output0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fullyconnected2_weight0", 
              "inputs": []
            }, 
            {
              "op": "null", 
              "name": "fullyconnected2_bias0", 
              "inputs": []
            }, 
            {
              "op": "FullyConnected", 
              "name": "fullyconnected2", 
              "attrs": {"num_hidden": "256"}, 
              "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
            }
          ], 
          "arg_nodes": [0, 1, 2], 
          "node_row_ptr": [0, 1, 2, 3, 4], 
          "heads": [[3, 0, 0]]
        }
      ]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[4, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "model", 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    56
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64
  ], 
  "heads": [[57, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10500]}
}
